/************************************************************************
 * <br>
 * <ul>
 * <li>版权所有：唐山弘川科技有限公司 2009－2020</li>
 * <li>创建日期：2009-8-7</li>
 * <li>初始作者：刘川</li>
 * </ul>
 * <ul>
 * <b>修订历史</b>
 * <li>1、</li>
 * </ul>
 ***********************************************************************/
package org.hy.commons.xml ;


/**
 * <ul>
 * <li>设计作者：刘川</li>
 * <li>设计日期：2009-8-7</li>
 * <li>设计时间：下午08:58:01</li>
 * <li>设计目的：表现具有持久化能力的接口</li>
 * </ul>
 * <ul>
 * <b>修订历史</b>
 * <li>1、</li>
 * </ul>
 */
public interface Persistable extends 
Identifierable < String >
{

}
